app/controllers/addresses_controller.rb

  def index
    @addresses = Address.all
	  @current_address = Address.find(params[:user_id])
---
SELECT  "addresses".* FROM "addresses" WHERE "addresses"."id" = $1 LIMIT $2  [["id", 44], ["LIMIT", 1]]