app/controllers/addresses_controller.rb

SELECT "addresses".* FROM "addresses"
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 5], ["LIMIT", 1]]
SELECT "addresses".* FROM "addresses" INNER JOIN "users" ON "users"."id" = "addresses"."user_id" WHERE "users"."id" = $1  [["id", 44]]
---
  def index
	  @addresses = Address.all
	@user = User.find_by(id: current_user.id)
	  # 현재 로그인 중인 유저의 주소 목록을 조회합니다.
	@currentaddress = Address.joins(:user).where(users: {id: @user.id})

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 44], ["LIMIT", 1]]
---
  def new
    @address = Address.new
	@user = User.find_by(id: current_user.id)

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
INSERT INTO "addresses" ("address", "address_name", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["address", "22"], ["address_name", "22"], ["user_id", 44], ["created_at", "2022-12-05 13:30:10.959625"], ["updated_at", "2022-12-05 13:30:10.959625"]]
---
  def create
    @address = Address.new(address_params)

	  @user = User.find_by(id: current_user.id)
	@address.user_id = @user.id

	  puts @address.user_id
    respond_to do |format|
      if @address.save