app/controllers/baskets_controller.rb

  def index
    @baskets = Basket.all
---
SELECT "baskets".* FROM "baskets"