app/controllers/ceos_controller.rb

SELECT "ceos".* FROM "ceos"
---
  def index
    @ceos = Ceo.all