app/controllers/customers_controller.rb

  def index
    @customers = Customer.all
	@users = User.all
---
SELECT "customers".* FROM "customers"
SELECT "users".* FROM "users"
SELECT SUM("users"."id") FROM "users"