app/controllers/dibs_controller.rb

SELECT "dibs".* FROM "dibs"
---
  def index
    @dibs = Dib.all