app/controllers/user_orders_controller.rb

SELECT "user_orders".* FROM "user_orders"
---
  def index
    @user_orders = UserOrder.all